import React from "react";
import Slider from "react-slick";

const testimonialData = [
  {
    id: 1,
    name: "Θεωρητική Κατάρτιση για Αξιόπιστη Προνοσοκομειακή Φροντίδα",
    text: "Η συνεχής θεωρητική κατάρτιση και η συμμετοχή των μελών μας σε επιμορφωτικές ημερίδες και σεμινάρια υγειονομικού ενδιαφέροντος, εγγυάται την αξιοπιστία της παρεχομένης προνοσοκομειακής φροντίδας.",
    img: "/src/assets/images/1.jpg",
  },
  {
    id: 1,
    name: "Εμπέδωση Δεξιοτήτων για Ασφαλή Διαχείριση Τραυματιών",
    text: " Η επαναληπτική άσκηση δεξιοτήτων, όπως η ακινητοποίηση και διακομιδή του τραυματία, εμπεδώνει την ορθή εφαρμογή τους από τους εθελοντές.",
    img: "/src/assets/images/2.jpg",
  },
  {
    id: 1,
    name: "Δυναμική Παρουσία στο Ετήσιο Συνέδριο της ΕΕΕΠΦ",
    text: " Η ομάδα μας συμμετείχε με ικανοποιητικό αριθμό μελών στο ετήσιο πολυήμερο συνέδριο ​της ΕΕΕΠΦ",
    img: "/src/assets/images/3.jpg",
  },
  {
    id: 1,
    name: "Συμμετοχή στην Εμπνευσμένη Ημερίδα Τραύματος του 424 ΓΣΝ",
    text: "Η ημερίδα τραύματος που διοργάνωσε το 424 στρατιωτικό νοσοκομείο ήταν άκρως ενδιαφέρουσα.",
    img: "/src/assets/images/4.jpg",
  },
  {
    id: 1,
    name: "Αξιοπιστία και Ασφάλεια στη Διάσωση σε Δύσκολα Πεδία",
    text: "Η αξιόπιστη και ασφαλής λειτουργία του τμήματος  της τεχνικής διάσωσης είναι απαραίτητη όταν ζητούμενο είναι η έρευνα και διάσωση εκτός του αστικού ιστού, σε ορεινά και υδάτινα επιχειρησιακά πεδία.",
    img: "/src/assets/images/5.jpg",
  },
  {
    id: 1,
    name: "Διεθνή Πρότυπα INSARAG για Αποτελεσματική Αστική Διάσωση",
    text: "Η γνώση και η συνεπής πρακτική εφαρμογή των διεθνών προτύπων στις ασκήσεις μας, όπως ισχύουν από τον INSARAG στην Αστική έρευνα και διάσωση συνεπεία μαζικής κατάρρευσης, ασφαλίζουν και καθιστούν αποτελεσματική την όποια σχετική επιχείρηση και την αγαστή ​συνεργασία με τους διεθνείς φορείς SAR. ",
    img: "/src/assets/images/6.jpg",
  },
  {
    id: 1,
    name: "Αδειοδότηση Ραδιοσυχνοτήτων για Αποτελεσματικό Επιχειρησιακό Συντονισμό",
    text: " Η αδειοδότηση της οργάνωσής μας  από την ΕΕΤΤ (Εθνική Επιτροπή Τηλεπικοινωνιών και Ταχυδρομείων) και η απόκτηση και χρήση ιδιόκτητων ραδιοσυχνοτήτων, εξασφαλίζει την απαραίτητη επικοινωνία και προϋποθέτει τον απαραίτητο συντονισμό των επιχειρησιακών αναγκών μας.",
    img: "/src/assets/images/7.jpg",
  },
  {
    id: 1,
    name: "Συνεργασία με την Π.Υ. για Ασφαλή Δασοπροστασία και Δασοπυρόσβεση",
    text: " Τα μέλη της οργάνωσής μας, ευαισθητοποιημένα σε ζητήματα προστασίας του περιβάλλοντος,  παρακολουθούν το ετήσιο πρόγραμμα δασοπροστασίας και δασοπυρόσβεσης της Π.Υ., ώστε με επάρκεια και κυρίως με ασφάλεια να επικουρούν τον κρατικό φορέα όταν και όπου απαιτείται.  Ευχαριστούμε τον 3ο σταθμό της Π.Υ.  που μας παρέχει απλόχερα τη σχετική γνώση.",
    img: "/src/assets/images/8.jpg",
  },
  {
    id: 1,
    name: "Γνώση και Συνεργασία για Αντιμετώπιση Πλημμυρικών Φαινομένων",
    text: "Η συνεχώς αυξανόμενη συχνότητα και ένταση πλημμυρικών φαινομένων καθιστά τη γνώση πρόληψης και αντιμετώπισής τους επιβεβλημένη. Ευχαριστούμε το τμήμα υδραυλικής του ΑΠΘ για τη στενή συνεργασία και την παροχή τεχνογνωσίας στο υψηλότερο επίπεδο εγκυρότητας και αξιοπιστίας.",
    img: "/src/assets/images/9.jpg",
  },
  {
    id: 1,
    name: "Εκπαίδευση ΜΥΣ με το Παγκοσμίως Αναγνωρισμένο Σύστημα ETS",
    text: "Μέλη της οργάνωσής μας εκπαιδεύτηκαν επί διημέρου σε ασκήσεις προσομοίωσης για την αντιμετώπιση και ορθή διαχείριση ΜΥΣ (Μαζικών Υγειονομικών Συμβάντων), σε κλιμακούμενης δυσκολίας σενάρια με χρήση του παιδαγωγικού εργαλείου ETS (Emergo Training System) στο εκπαιδευτικό κέντρο της ΕΕΕΠΦ, που αποτελεί ένα από τα 14 πιστοποιημένα εκπαιδευτικά κέντρα παγκοσμίως στο συγκεκριμένο αντικείμενο. ",
    img: "/src/assets/images/10.jpg",
  },

];

const Testimonial = () => {
  var settings = {
    dots: true,
    arrows: false,
    infinite: true,
    speed: 600,
    slidesToShow: 1,
    slidesToScroll: 1,
    autoplay: false,
    autoplaySpeed: 3000,
    cssEase: "linear",
    pauseOnHover: true,
    pauseOnFocus: true,
  };
  return (
    <>
      <div className="py-10">
        <div className="container">
          {/* testimonial section */}
          <div
            data-aos="fade-up"
            className="grid grid-cols-1 max-w-screen-xl mx-auto gap-6"
          >
            <Slider {...settings}>
              {testimonialData.map(({ id, name, text, img }) => {
                return (
                  <div key={id} className="my-6">
                    {/* card */}
                    <div className="flex flex-col sm:flex-row gap-5 md:gap-14 p-4 mx-4 rounded-xl dark:bg-gray-800 relative">
                      <img
                        src={img}
                        alt=""
                        className="block mx-auto h-[300px] w-full sm:w-[200px] object-cover"
                      />
                      <div className="space-y-4">
                        <p className="text-gray-500 text-black/80 dark:text-white/80 xl:pr-40">
                          “{text}”
                        </p>
                        <h1 className="text-xl font-bold">{name}</h1>
                      </div>
                      <p className="text-black/10 text-[12rem] font-serif absolute bottom-0 right-0">
                        ,,
                      </p>
                    </div>
                  </div>
                );
              })}
            </Slider>
          </div>
        </div>
      </div>
    </>
  );
};

export default Testimonial;
